'''
numpy切片
与python相似
数组[起始值:终止值:步长]
可以针对多维数组来切片
缺省起始值:首元素(步长为正), 尾元素(步长为负) =>逆向
缺省终止值:尾后(步长为正) ，首前(步长为负)
缺省步长：1
'''
import numpy as np
a = np.arange(1, 10)
print(a)
# print(a)
# print(a[:3])
# print(a[3:6])
# print(a[6:])
print(a[:-4:-1])#[9 8 7]
print(a[-1])
# print(a[...]) #[1 2 3 4 5 6 7 8 9]

# b = np.arange(1, 25).reshape(2, 3, 4)
# print(b)

# print(b[:,0, 0])
# #      [页,行,列]
# print(b[0,:,:])

# print(b[0,1,::2])#[5 7]

# print(b[-1,1:,2:])
'''
[[19 20]
 [23 24]]
'''
# print(b[:,1:,1])
'''
[[ 6 10]
 [18 22]]
 '''
# print(b[1, 1, ::2]) #[17 19]

#一个或者一个以上切片: a[...],a[:]


